InformationRegisters/ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТемаРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыПочтовыхРассылок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтправленныеСообщения/Ext/ManagerModule.bsl
Процедура ЗафиксироватьОтправку(КлиентСсылка, ТемаРассылки, Отправлено) Экспорт
	
	МЗ = РегистрыСведений.ОтправленныеСообщения.СоздатьМенеджерЗаписи();
	МЗ.Клиент = КлиентСсылка;
	МЗ.ТемаРассылки = ТемаРассылки;
	МЗ.Отправлено	= Отправлено;	
	МЗ.Записать();
	
КонецПроцедуры
